src/test/resources/soap/request/request-encryption-xwss.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
   <SOAP-ENV:Header>
      <wsse:Security
         xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
         SOAP-ENV:mustUnderstand="1">
         <wsse:BinarySecurityToken
            xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
            EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary"
            ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"
            wsu:Id="XWSSGID-1511724967082-1120123995">MIICwTCCAiqgAwIBAgIEq0Rx5DANBgkqhkiG9w0BAQsFADBxMRswGQYDVQQDDBJ3d3cuYmVybmFyZG9tZy5jb20xEzARBgNVBAoMCmJlcm5hcmRvbWcxDTALBgNVBAsMBE5vbmUxDzANBgNVBAcMBkxvbmRvbjEQMA4GA1UECAwHRW5nbGFuZDELMAkGA1UEBhMCVUswIBcNMTYxMTI2MTkxNDQxWhgPMjExNzExMDIxOTE0NDFaMHExGzAZBgNVBAMMEnd3dy5iZXJuYXJkb21nLmNvbTETMBEGA1UECgwKYmVybmFyZG9tZzENMAsGA1UECwwETm9uZTEPMA0GA1UEBwwGTG9uZG9uMRAwDgYDVQQIDAdFbmdsYW5kMQswCQYDVQQGEwJVSzCBnzANBgkqhkiG9w0BAQEFAAOBjQAwgYkCgYEArNpb9igfv8WboW2N6aJPppF+gBw1sDU16zixMj/76AKABOHDBl8jC9tDdIM3tE3LRkuNeH2kqqaAOSgzFoYJrHQT4T/Wz7PP1LjeOZzyCOhkmwidQtJxW35cwcYNIVrsvROpoJtKo5DGqVoFckQ5XDBSDJuDOEMqGRiNCLjl5akCAwEAAaNkMGIwHQYDVR0OBBYEFP7W6oEOdj/D/hVDurwuf2lJxqiPMA8GA1UdEwEB/wQFMAMBAf8wCwYDVR0PBAQDAgG2MCMGA1UdJQQcMBoGCCsGAQUFBwMBBggrBgEFBQcDAgYEVR0lADANBgkqhkiG9w0BAQsFAAOBgQAkM6uQYn64he2wxW/a+PpEsQw7R0NK/ORpG13piQUXItg9QFrsUiqHf+NdIPK4C0mu8CNgtToaR/nM1kGYfhp5BowS2CgZplUyOCdCW+/4S/aAN/l78rIe6NXsu5xzrBmqCxcw9v8a4b09zse7UT3lpj2qJOW4hoFSl8Pr8yuGdw==
         </wsse:BinarySecurityToken>
         <xenc:EncryptedKey xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"
            Id="XWSSGID-1511725020721-1924134535">
            <xenc:EncryptionMethod
               Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-oaep-mgf1p" />
            <ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
               <wsse:SecurityTokenReference>
                  <wsse:Reference URI="#XWSSGID-1511724967082-1120123995"
                     ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" />
               </wsse:SecurityTokenReference>
            </ds:KeyInfo>
            <xenc:CipherData>
               <xenc:CipherValue>NhK4gGrQAf2nD/z9CtUlRvcoq/DpvoAf70aSonoIbUDx+2zG6KmYVIzKPV8ND3txdTAnEdp3hve7
                  NO94Ox66orWPWqmBIwf9pya+Amm5GSVUmSbj/qk3xu8NUcPFFoIYVDvy1PfwZannh3ejoUy40ttP
                  81FKFCTREbn9+kBKGic=
               </xenc:CipherValue>
            </xenc:CipherData>
         </xenc:EncryptedKey>
         <xenc:ReferenceList xmlns:xenc="http://www.w3.org/2001/04/xmlenc#">
            <xenc:DataReference URI="#XWSSGID-15117250207831219015833" />
         </xenc:ReferenceList>
      </wsse:Security>
   </SOAP-ENV:Header>
   <SOAP-ENV:Body>
      <xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"
         Id="XWSSGID-15117250207831219015833" Type="http://www.w3.org/2001/04/xmlenc#Content">
         <xenc:EncryptionMethod
            Algorithm="http://www.w3.org/2001/04/xmlenc#aes128-cbc" />
         <ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
            <wsse:SecurityTokenReference
               xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
               <wsse:Reference URI="#XWSSGID-1511725020721-1924134535" />
            </wsse:SecurityTokenReference>
         </ds:KeyInfo>
         <xenc:CipherData>
            <xenc:CipherValue>p3kdPxdqCQd8nyHZQBr9WKClFrpndkX7WujHj96j05jO7dtDBQ7egJASCM6KH7v75cjQP4fY4WLn
               2lQoi/NpA2l4jAvveQE38Lv+LksG2A0FnhfNtRgFWDT1VZ+fFH4xE1095O1kVgTcYgXe+FsFQ03G
               gsmxWAIMu/kqzLeRtHGZGdGPFRJf5ar+zomhRPqHBhnEYUC0ANGX8ozmUndyIp38YIP4NJwFt6w8
               6ediA5LABi7puVTv2FIxHfl7xJRo
            </xenc:CipherValue>
         </xenc:CipherData>
      </xenc:EncryptedData>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>